# Напишите программу для кодирования текстового сообщения в соответствии с кодом Морзе.

# зипаю два списка в словарь
# перебираю el в words
# вывожу по ключу el элемент в словаре alphabet

letters = [c for c in "ABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789"]
morse = [
    ".-",
    "-...",
    "-.-.",
    "-..",
    ".",
    "..-.",
    "--.",
    "....",
    "..",
    ".---",
    "-.-",
    ".-..",
    "--",
    "-.",
    "---",
    ".--.",
    "--.-",
    ".-.",
    "...",
    "-",
    "..-",
    "...-",
    ".--",
    "-..-",
    "-.--",
    "--..",
    "-----",
    ".----",
    "..---",
    "...--",
    "....-",
    ".....",
    "-....",
    "--...",
    "---..",
    "----.",
]

alphabet = dict(zip(letters, morse))
words = [i.upper() for i in input() if i.isalnum()]

for el in words:
    print(alphabet[el], end=" ")
